       IDENTIFICATION DIVISION.
       PROGRAM-ID.    OKVIR.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PODATKI-ZA-OKVIR.
           03 OKVIR-FILL.
                     05 OKVIR-2 PIC X(8) VALUE "É»È¼ÍÍºº".
      *         05 OKVIR-2 PIC X(8) VALUE "Ú¿ÀÙÄÄ³³".
           03 OKVIR-OCC REDEFINES OKVIR-FILL.
               05 ZGORNJI-LEVI PIC X.
               05 ZGORNJI-DESNI PIC X.
               05 SPODNJI-LEVI PIC X.
               05 SPODNJI-DESNI PIC X.
               05 VODORAVNI-ZGORNJI PIC X.
               05 VODORAVNI-SPODNJI PIC X.
               05 VERTIKALNI-LEVI PIC X.
               05 VERTIKALNI-DESNI PIC X.
           03 OKV-IND1 PIC 999.
           03 OKV-IND-DS PIC 9.
           03 OKV-IND2 PIC 999.
           03 OKV-IND3 PIC 999.
       01 LIN PIC 99.
       01 COLM PIC 99.
       LINKAGE SECTION.
       01 OKVIR-LCVD.
           03 OKV-LIN PIC 99.
           03 OKV-COL PIC 999.
           03 OKV-VIS PIC 99.
           03 OKV-DOL PIC 999.
       PROCEDURE DIVISION USING OKVIR-LCVD.
       OKV-1.
           MOVE OKV-LIN TO LIN MOVE OKV-COL TO COLM
           DISPLAY ZGORNJI-LEVI LINE LIN COL COLM.
           PERFORM OKV-2
             VARYING OKV-IND1 FROM 1 BY 1 UNTIL OKV-IND1 = OKV-DOL.
       OKV-2.
           COMPUTE OKV-IND2 = OKV-IND1 + OKV-COL
           MOVE OKV-IND2 TO COLM
           DISPLAY VODORAVNI-ZGORNJI LINE LIN COL COLM.
       OKV-3.
           COMPUTE OKV-IND2 = OKV-COL + OKV-DOL + 1
           MOVE OKV-IND2 TO COLM
           DISPLAY ZGORNJI-DESNI LINE LIN COL COLM.
           COMPUTE OKV-IND3 = OKV-COL + OKV-DOL + 1
           PERFORM OKV-4
               VARYING OKV-IND1 FROM 1 BY 1 UNTIL OKV-IND1 = OKV-VIS.
       OKV-4.
           COMPUTE OKV-IND2 = OKV-LIN + OKV-IND1
           MOVE OKV-IND2 TO LIN MOVE OKV-COL TO COLM
           DISPLAY VERTIKALNI-LEVI LINE LIN COL COLM
           MOVE OKV-IND3 TO COLM
           DISPLAY VERTIKALNI-DESNI LINE LIN COL COLM.
       OKV-5.
           ADD 1 TO OKV-IND2
           MOVE OKV-IND2 TO LIN
           MOVE OKV-COL TO COLM
           DISPLAY SPODNJI-LEVI LINE LIN COL COLM
           MOVE OKV-IND3 TO COLM
           DISPLAY SPODNJI-DESNI LINE LIN COL COLM.
           PERFORM OKV-6
               VARYING OKV-IND1 FROM 1 BY 1 UNTIL OKV-IND1 = OKV-DOL.
       OKV-6.
           COMPUTE OKV-IND3 = OKV-COL + OKV-IND1
           MOVE OKV-IND3 TO COLM
           DISPLAY VODORAVNI-SPODNJI LINE LIN COL COLM.
       OKV-EX. EXIT PROGRAM.
